STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_cm33.h
/******************  Bit definition for DMA_CTR2 register  *******************/
#define DMA_CTR2_REQSEL_Pos     (0U)
#define DMA_CTR2_REQSEL_Msk     (0xFFUL << DMA_CTR2_REQSEL_Pos)             /*!< 0x000000FF */
#define DMA_CTR2_REQSEL         DMA_CTR2_REQSEL_Msk                        /*!< DMA hardware request selection */
#define DMA_CTR2_SWREQ_Pos      (9U)
#define DMA_CTR2_SWREQ_Msk      (0x1UL << DMA_CTR2_SWREQ_Pos)               /*!< 0x00000200 */
#define DMA_CTR2_SWREQ          DMA_CTR2_SWREQ_Msk                         /*!< Software request */
#define DMA_CTR2_DREQ_Pos       (10U)
#define DMA_CTR2_DREQ_Msk       (0x1UL << DMA_CTR2_DREQ_Pos)                /*!< 0x00000400 */
#define DMA_CTR2_DREQ           DMA_CTR2_DREQ_Msk                          /*!< Destination hardware request */
#define DMA_CTR2_BREQ_Pos       (11U)
#define DMA_CTR2_BREQ_Msk       (0x1UL << DMA_CTR2_BREQ_Pos)                /*!< 0x00000800 */
#define DMA_CTR2_BREQ           DMA_CTR2_BREQ_Msk                          /*!< Block hardware request */
#define DMA_CTR2_PFREQ_Pos      (12U)
#define DMA_CTR2_PFREQ_Msk      (0x1UL << DMA_CTR2_PFREQ_Pos)               /*!< 0x00001000 */
#define DMA_CTR2_PFREQ          DMA_CTR2_PFREQ_Msk                         /*!< Hardware request in peripheral flow control mode */
#define DMA_CTR2_TRIGM_Pos      (14U)
#define DMA_CTR2_TRIGM_Msk      (0x3UL << DMA_CTR2_TRIGM_Pos)               /*!< 0x0000C000 */
#define DMA_CTR2_TRIGM          DMA_CTR2_TRIGM_Msk                         /*!< Trigger mode */
#define DMA_CTR2_TRIGM_0        (0x1UL << DMA_CTR2_TRIGM_Pos)               /*!< Bit 0 */
#define DMA_CTR2_TRIGM_1        (0x2UL << DMA_CTR2_TRIGM_Pos)               /*!< Bit 1 */
#define DMA_CTR2_TRIGSEL_Pos    (16U)
#define DMA_CTR2_TRIGSEL_Msk    (0x7FUL << DMA_CTR2_TRIGSEL_Pos)            /*!< 0x007F0000 */
#define DMA_CTR2_TRIGSEL        DMA_CTR2_TRIGSEL_Msk                       /*!< Trigger event input selection */
#define DMA_CTR2_TRIGPOL_Pos    (24U)
#define DMA_CTR2_TRIGPOL_Msk    (0x3UL << DMA_CTR2_TRIGPOL_Pos)             /*!< 0x03000000 */
#define DMA_CTR2_TRIGPOL        DMA_CTR2_TRIGPOL_Msk                       /*!< Trigger event polarity */
#define DMA_CTR2_TRIGPOL_0      (0x1UL << DMA_CTR2_TRIGPOL_Pos)             /*!< Bit 0 */
#define DMA_CTR2_TRIGPOL_1      (0x2UL << DMA_CTR2_TRIGPOL_Pos)             /*!< Bit 1 */
#define DMA_CTR2_TCEM_Pos       (30U)
#define DMA_CTR2_TCEM_Msk       (0x3UL << DMA_CTR2_TCEM_Pos)                /*!< 0xC0000000 */
#define DMA_CTR2_TCEM           DMA_CTR2_TCEM_Msk                          /*!< Transfer complete event mode */
#define DMA_CTR2_TCEM_0         (0x1UL << DMA_CTR2_TCEM_Pos)                /*!< Bit 0 */
#define DMA_CTR2_TCEM_1         (0x2UL << DMA_CTR2_TCEM_Pos)                /*!< Bit 1 */

/******************  Bit definition for DMA_CBR1 register  *******************/
#define DMA_CBR1_BNDT_Pos      (0U)
#define DMA_CBR1_BNDT_Msk      (0xFFFFUL << DMA_CBR1_BNDT_Pos)              /*!< 0x0000FFFF */
#define DMA_CBR1_BNDT          DMA_CBR1_BNDT_Msk                           /*!< Block number of data bytes to transfer from the source */
#define DMA_CBR1_BRC_Pos       (16U)
#define DMA_CBR1_BRC_Msk       (0x7FFUL << DMA_CBR1_BRC_Pos)               /*!< 0x07FF0000 */
#define DMA_CBR1_BRC           DMA_CBR1_BRC_Msk                            /*!< Block repeat counter */
#define DMA_CBR1_SDEC_Pos      (28U)
#define DMA_CBR1_SDEC_Msk      (0x1UL << DMA_CBR1_SDEC_Pos)                 /*!< 0x10000000 */
#define DMA_CBR1_SDEC          DMA_CBR1_SDEC_Msk                           /*!< Source address decrement */
#define DMA_CBR1_DDEC_Pos      (29U)
#define DMA_CBR1_DDEC_Msk      (0x1UL << DMA_CBR1_DDEC_Pos)                 /*!< 0x20000000 */
#define DMA_CBR1_DDEC          DMA_CBR1_DDEC_Msk                           /*!< Destination address decrement */
#define DMA_CBR1_BRSDEC_Pos    (30U)
#define DMA_CBR1_BRSDEC_Msk    (0x1UL << DMA_CBR1_BRSDEC_Pos)               /*!< 0x40000000 */
#define DMA_CBR1_BRSDEC        DMA_CBR1_BRSDEC_Msk                         /*!< Block repeat source address decrement */
#define DMA_CBR1_BRDDEC_Pos    (31U)
#define DMA_CBR1_BRDDEC_Msk    (0x1UL << DMA_CBR1_BRDDEC_Pos)               /*!< 0x80000000 */
#define DMA_CBR1_BRDDEC        DMA_CBR1_BRDDEC_Msk                         /*!< Block repeat destination address decrement */

/******************  Bit definition for DMA_CSAR register  ********************/
#define DMA_CSAR_SA_Pos        (0U)
#define DMA_CSAR_SA_Msk        (0xFFFFFFFFUL << DMA_CSAR_SA_Pos)            /*!< 0xFFFFFFFF */
#define DMA_CSAR_SA            DMA_CSAR_SA_Msk                             /*!< Source Address */

/******************  Bit definition for DMA_CDAR register  *******************/
#define DMA_CDAR_DA_Pos        (0U)
#define DMA_CDAR_DA_Msk        (0xFFFFFFFFUL << DMA_CDAR_DA_Pos)             /*!< 0xFFFFFFFF */
#define DMA_CDAR_DA            DMA_CDAR_DA_Msk                              /*!< Destination address */

/******************  Bit definition for DMA_CTR3 register  *******************/
#define DMA_CTR3_SAO_Pos       (0U)
#define DMA_CTR3_SAO_Msk       (0x1FFFUL << DMA_CTR3_SAO_Pos)               /*!< 0x00001FFF */
#define DMA_CTR3_SAO           DMA_CTR3_SAO_Msk                            /*!< Source address offset increment */
#define DMA_CTR3_DAO_Pos       (16U)
#define DMA_CTR3_DAO_Msk       (0x1FFFUL << DMA_CTR3_DAO_Pos)               /*!< 0x1FFF0000 */
#define DMA_CTR3_DAO           DMA_CTR3_DAO_Msk                            /*!< Destination address offset increment */

/******************  Bit definition for DMA_CBR2 register  *******************/
#define DMA_CBR2_BRSAO_Pos     (0U)
#define DMA_CBR2_BRSAO_Msk     (0xFFFFUL << DMA_CBR2_BRSAO_Pos)             /*!< 0x0000FFFF */
#define DMA_CBR2_BRSAO         DMA_CBR2_BRSAO_Msk                          /*!< Block repeated source address offset */
#define DMA_CBR2_BRDAO_Pos     (16U)
#define DMA_CBR2_BRDAO_Msk     (0xFFFFUL << DMA_CBR2_BRDAO_Pos)             /*!< 0xFFFF0000 */
#define DMA_CBR2_BRDAO         DMA_CBR2_BRDAO_Msk                          /*!< Block repeated destination address offset */

/******************  Bit definition for DMA_CLLR register  *******************/
#define DMA_CLLR_LA_Pos        (2U)
#define DMA_CLLR_LA_Msk        (0x3FFFUL << DMA_CLLR_LA_Pos)                /*!< 0x0000FFFC */
#define DMA_CLLR_LA            DMA_CLLR_LA_Msk                             /*!< Pointer to the next linked-list data structure */
#define DMA_CLLR_ULL_Pos       (16U)
#define DMA_CLLR_ULL_Msk       (0x1UL << DMA_CLLR_ULL_Pos)                  /*!< 0x00010000 */
#define DMA_CLLR_ULL           DMA_CLLR_ULL_Msk                            /*!< Update link address register from memory */
#define DMA_CLLR_UB2_Pos       (25U)
#define DMA_CLLR_UB2_Msk       (0x1UL << DMA_CLLR_UB2_Pos)                  /*!< 0x02000000 */
#define DMA_CLLR_UB2           DMA_CLLR_UB2_Msk                            /*!< Update block register 2 from memory */
#define DMA_CLLR_UT3_Pos       (26U)
#define DMA_CLLR_UT3_Msk       (0x1UL << DMA_CLLR_UT3_Pos)                  /*!< 0x04000000 */
#define DMA_CLLR_UT3           DMA_CLLR_UT3_Msk                            /*!< Update transfer register 3 from SRAM */
#define DMA_CLLR_UDA_Pos       (27U)
#define DMA_CLLR_UDA_Msk       (0x1UL << DMA_CLLR_UDA_Pos)                  /*!< 0x08000000 */
#define DMA_CLLR_UDA           DMA_CLLR_UDA_Msk                            /*!< Update destination address register from SRAM */
#define DMA_CLLR_USA_Pos       (28U)
#define DMA_CLLR_USA_Msk       (0x1UL << DMA_CLLR_USA_Pos)                  /*!< 0x10000000 */
#define DMA_CLLR_USA           DMA_CLLR_USA_Msk                            /*!< Update source address register from SRAM */
#define DMA_CLLR_UB1_Pos       (29U)
#define DMA_CLLR_UB1_Msk       (0x1UL << DMA_CLLR_UB1_Pos)                  /*!< 0x20000000 */
#define DMA_CLLR_UB1           DMA_CLLR_UB1_Msk                            /*!< Update block register 1 from SRAM */
#define DMA_CLLR_UT2_Pos       (30U)
#define DMA_CLLR_UT2_Msk       (0x1UL << DMA_CLLR_UT2_Pos)                  /*!< 0x40000000 */
#define DMA_CLLR_UT2           DMA_CLLR_UT2_Msk                            /*!< Update transfer register 2 from SRAM */
#define DMA_CLLR_UT1_Pos       (31U)
#define DMA_CLLR_UT1_Msk       (0x1UL << DMA_CLLR_UT1_Pos)                  /*!< 0x80000000 */
#define DMA_CLLR_UT1           DMA_CLLR_UT1_Msk                            /*!< Update transfer register 1 from SRAM */

/******************************************************************************/
/*                                                                            */
/*                  DTS Registers bits definitions                            */
/*                                                                            */
/******************************************************************************/
/***************  Bit definition for DTS_PVTREG_LOCK register  ****************/
#define DTS_PVTREG_LOCK_LOCK_Pos                    (0U)
#define DTS_PVTREG_LOCK_LOCK_Msk                    (0xFFFFFFFFUL << DTS_PVTREG_LOCK_LOCK_Pos)            /*!< 0xFFFFFFFF */
#define DTS_PVTREG_LOCK_LOCK                        DTS_PVTREG_LOCK_LOCK_Msk                             /*!< PVT software lock register */

/****************  Bit definition for DTS_PVTLOCK_SR register  ****************/
#define DTS_PVTLOCK_SR_SW_LOCK_STATUS_Pos           (0U)
#define DTS_PVTLOCK_SR_SW_LOCK_STATUS_Msk           (0x1UL << DTS_PVTLOCK_SR_SW_LOCK_STATUS_Pos)          /*!< 0x00000001 */
#define DTS_PVTLOCK_SR_SW_LOCK_STATUS               DTS_PVTLOCK_SR_SW_LOCK_STATUS_Msk                    /*!< Software lock input status */
#define DTS_PVTLOCK_SR_HW_LOCK_STATUS_Pos           (1U)
#define DTS_PVTLOCK_SR_HW_LOCK_STATUS_Msk           (0x1UL << DTS_PVTLOCK_SR_HW_LOCK_STATUS_Pos)          /*!< 0x00000002 */
#define DTS_PVTLOCK_SR_HW_LOCK_STATUS               DTS_PVTLOCK_SR_HW_LOCK_STATUS_Msk                    /*!< Hardware lock input status */

/****************  Bit definition for DTS_PVTTMR_CR register  *****************/
#define DTS_PVTTMR_CR_TMR_DELAY_Pos                 (0U)
#define DTS_PVTTMR_CR_TMR_DELAY_Msk                 (0xFFFFUL << DTS_PVTTMR_CR_TMR_DELAY_Pos)             /*!< 0x0000FFFF */
#define DTS_PVTTMR_CR_TMR_DELAY                     DTS_PVTTMR_CR_TMR_DELAY_Msk                          /*!< Timer delay */
#define DTS_PVTTMR_CR_TMR_RUN_Pos                   (16U)
#define DTS_PVTTMR_CR_TMR_RUN_Msk                   (0x1UL << DTS_PVTTMR_CR_TMR_RUN_Pos)                  /*!< 0x00010000 */
#define DTS_PVTTMR_CR_TMR_RUN                       DTS_PVTTMR_CR_TMR_RUN_Msk                            /*!< Timer count enable bit */

/****************  Bit definition for DTS_PVTTMR_SR register  *****************/
#define DTS_PVTTMR_SR_TMR_BUSY_Pos                  (0U)
#define DTS_PVTTMR_SR_TMR_BUSY_Msk                  (0x1UL << DTS_PVTTMR_SR_TMR_BUSY_Pos)                 /*!< 0x00000001 */
#define DTS_PVTTMR_SR_TMR_BUSY                      DTS_PVTTMR_SR_TMR_BUSY_Msk                           /*!< Counter busy flag */
#define DTS_PVTTMR_SR_TMR_DONE_Pos                  (1U)
#define DTS_PVTTMR_SR_TMR_DONE_Msk                  (0x1UL << DTS_PVTTMR_SR_TMR_DONE_Pos)                 /*!< 0x00000002 */
#define DTS_PVTTMR_SR_TMR_DONE                      DTS_PVTTMR_SR_TMR_DONE_Msk                           /*!< Counter delay expiration flag */

/****************  Bit definition for DTS_PVTTMR_ICR register  ****************/
#define DTS_PVTTMR_ICR_TMR_IRQ_CLR_Pos              (0U)
#define DTS_PVTTMR_ICR_TMR_IRQ_CLR_Msk              (0x1UL << DTS_PVTTMR_ICR_TMR_IRQ_CLR_Pos)             /*!< 0x00000001 */
#define DTS_PVTTMR_ICR_TMR_IRQ_CLR                  DTS_PVTTMR_ICR_TMR_IRQ_CLR_Msk                       /*!< Timer IRQ clear bit */

/**************  Bit definition for DTS_PVTTMRIRQTESTR register  **************/
#define DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Pos         (0U)
#define DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Msk         (0x1UL << DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Pos)        /*!< 0x00000001 */
#define DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST             DTS_PVTTMRIRQTESTR_TMR_IRQ_TEST_Msk                  /*!< Timer IRQ test bit */

