STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_cm33.h
/*****************  Bit definition for EXTI_EXTICR3 register  ***************/
#define EXTI_EXTICR3_EXTI8_Pos        (0U)
#define EXTI_EXTICR3_EXTI8_Msk        (0xFFUL << EXTI_EXTICR3_EXTI8_Pos)        /*!< 0x000000FF */
#define EXTI_EXTICR3_EXTI8            EXTI_EXTICR3_EXTI8_Msk                   /*!<EXTI 8 configuration */
#define EXTI_EXTICR3_EXTI9_Pos        (8U)
#define EXTI_EXTICR3_EXTI9_Msk        (0xFFUL << EXTI_EXTICR3_EXTI9_Pos)        /*!< 0x0000FF00 */
#define EXTI_EXTICR3_EXTI9            EXTI_EXTICR3_EXTI9_Msk                   /*!<EXTI 9 configuration */
#define EXTI_EXTICR3_EXTI10_Pos       (16U)
#define EXTI_EXTICR3_EXTI10_Msk       (0xFFUL << EXTI_EXTICR3_EXTI10_Pos)       /*!< 0x00FF0000 */
#define EXTI_EXTICR3_EXTI10           EXTI_EXTICR3_EXTI10_Msk                  /*!<EXTI 10 configuration */
#define EXTI_EXTICR3_EXTI11_Pos       (24U)
#define EXTI_EXTICR3_EXTI11_Msk       (0xFFUL << EXTI_EXTICR3_EXTI11_Pos)       /*!< 0xFF000000 */
#define EXTI_EXTICR3_EXTI11           EXTI_EXTICR3_EXTI11_Msk                  /*!<EXTI 11 configuration */

/**
  * @brief   EXTI8 configuration
  */
#define EXTI_EXTICR3_EXTI8_PA         ((0x00000000U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PA[8] pin */
#define EXTI_EXTICR3_EXTI8_PB         ((0x00000001U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PB[8] pin */
#define EXTI_EXTICR3_EXTI8_PC         ((0x00000002U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PC[8] pin */
#define EXTI_EXTICR3_EXTI8_PD         ((0x00000003U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PD[8] pin */
#define EXTI_EXTICR3_EXTI8_PE         ((0x00000004U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PE[8] pin */
#define EXTI_EXTICR3_EXTI8_PF         ((0x00000005U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PF[8] pin */
#define EXTI_EXTICR3_EXTI8_PG         ((0x00000006U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PG[8] pin */
#define EXTI_EXTICR3_EXTI8_PH         ((0x00000007U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PH[8] pin */
#define EXTI_EXTICR3_EXTI8_PI         ((0x00000008U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PI[8] pin */
#define EXTI_EXTICR3_EXTI8_PJ         ((0x00000009U)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PJ[8] pin */
/* No PK on EXTI8 */
#define EXTI_EXTICR3_EXTI8_PZ         ((0x0000000BU)<<EXTI_EXTICR3_EXTI8_Pos)         /*!<PZ[8] pin */

/**
  * @brief   EXTI9 configuration
  */
#define EXTI_EXTICR3_EXTI9_PA         ((0x00000000U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PA[9] pin */
#define EXTI_EXTICR3_EXTI9_PB         ((0x00000001U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PB[9] pin */
#define EXTI_EXTICR3_EXTI9_PC         ((0x00000002U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PC[9] pin */
#define EXTI_EXTICR3_EXTI9_PD         ((0x00000003U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PD[9] pin */
#define EXTI_EXTICR3_EXTI9_PE         ((0x00000004U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PE[9] pin */
#define EXTI_EXTICR3_EXTI9_PF         ((0x00000005U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PF[9] pin */
#define EXTI_EXTICR3_EXTI9_PG         ((0x00000006U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PG[9] pin */
#define EXTI_EXTICR3_EXTI9_PH         ((0x00000007U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PH[9] pin */
#define EXTI_EXTICR3_EXTI9_PI         ((0x00000008U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PI[9] pin */
#define EXTI_EXTICR3_EXTI9_PJ         ((0x00000009U)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PJ[9] pin */
/* No PK on EXTI9 */
#define EXTI_EXTICR3_EXTI9_PZ         ((0x0000000BU)<<EXTI_EXTICR3_EXTI9_Pos)         /*!<PZ[9] pin */

/**
  * @brief   EXTI10 configuration
  */
#define EXTI_EXTICR3_EXTI10_PA         ((0x00000000U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PA[10] pin */
#define EXTI_EXTICR3_EXTI10_PB         ((0x00000001U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PB[10] pin */
#define EXTI_EXTICR3_EXTI10_PC         ((0x00000002U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PC[10] pin */
#define EXTI_EXTICR3_EXTI10_PD         ((0x00000003U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PD[10] pin */
#define EXTI_EXTICR3_EXTI10_PE         ((0x00000004U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PE[10] pin */
#define EXTI_EXTICR3_EXTI10_PF         ((0x00000005U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PF[10] pin */
#define EXTI_EXTICR3_EXTI10_PG         ((0x00000006U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PG[10] pin */
#define EXTI_EXTICR3_EXTI10_PH         ((0x00000007U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PH[10] pin */
#define EXTI_EXTICR3_EXTI10_PI         ((0x00000008U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PI[10] pin */
#define EXTI_EXTICR3_EXTI10_PJ         ((0x00000009U)<<EXTI_EXTICR3_EXTI10_Pos)         /*!<PJ[10] pin */
/* No PK on EXTI10 */
/* No PZ on EXTI10 */

/**
  * @brief   EXTI11 configuration
  */
#define EXTI_EXTICR3_EXTI11_PA         ((0x00000000U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PA[11] pin */
#define EXTI_EXTICR3_EXTI11_PB         ((0x00000001U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PB[11] pin */
#define EXTI_EXTICR3_EXTI11_PC         ((0x00000002U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PC[11] pin */
#define EXTI_EXTICR3_EXTI11_PD         ((0x00000003U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PD[11] pin */
#define EXTI_EXTICR3_EXTI11_PE         ((0x00000004U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PE[11] pin */
#define EXTI_EXTICR3_EXTI11_PF         ((0x00000005U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PF[11] pin */
#define EXTI_EXTICR3_EXTI11_PG         ((0x00000006U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PG[11] pin */
#define EXTI_EXTICR3_EXTI11_PH         ((0x00000007U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PH[11] pin */
#define EXTI_EXTICR3_EXTI11_PI         ((0x00000008U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PI[11] pin */
#define EXTI_EXTICR3_EXTI11_PJ         ((0x00000009U)<<EXTI_EXTICR3_EXTI11_Pos)         /*!<PJ[11] pin */
/* No PK on EXTI11 */
/* No PZ on EXTI11 */

/*****************  Bit definition for EXTI_EXTICR4 register  ***************/
#define EXTI_EXTICR4_EXTI12_Pos       (0U)
#define EXTI_EXTICR4_EXTI12_Msk       (0xFFUL << EXTI_EXTICR4_EXTI12_Pos)       /*!< 0x000000FF */
#define EXTI_EXTICR4_EXTI12           EXTI_EXTICR4_EXTI12_Msk                  /*!<EXTI 12 configuration */
#define EXTI_EXTICR4_EXTI13_Pos       (8U)
#define EXTI_EXTICR4_EXTI13_Msk       (0xFFUL << EXTI_EXTICR4_EXTI13_Pos)       /*!< 0x0000FF00 */
#define EXTI_EXTICR4_EXTI13           EXTI_EXTICR4_EXTI13_Msk                  /*!<EXTI 13 configuration */
#define EXTI_EXTICR4_EXTI14_Pos       (16U)
#define EXTI_EXTICR4_EXTI14_Msk       (0xFFUL << EXTI_EXTICR4_EXTI14_Pos)       /*!< 0x00FF0000 */
#define EXTI_EXTICR4_EXTI14           EXTI_EXTICR4_EXTI14_Msk                  /*!<EXTI 14 configuration */
#define EXTI_EXTICR4_EXTI15_Pos       (24U)
#define EXTI_EXTICR4_EXTI15_Msk       (0xFFUL << EXTI_EXTICR4_EXTI15_Pos)       /*!< 0xFF000000 */
#define EXTI_EXTICR4_EXTI15           EXTI_EXTICR4_EXTI15_Msk                  /*!<EXTI 15 configuration */

/**
  * @brief   EXTI12 configuration
  */
#define EXTI_EXTICR4_EXTI12_PA         ((0x00000000U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PA[12] pin */
#define EXTI_EXTICR4_EXTI12_PB         ((0x00000001U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PB[12] pin */
#define EXTI_EXTICR4_EXTI12_PC         ((0x00000002U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PC[12] pin */
#define EXTI_EXTICR4_EXTI12_PD         ((0x00000003U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PD[12] pin */
#define EXTI_EXTICR4_EXTI12_PE         ((0x00000004U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PE[12] pin */
#define EXTI_EXTICR4_EXTI12_PF         ((0x00000005U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PF[12] pin */
#define EXTI_EXTICR4_EXTI12_PG         ((0x00000006U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PG[12] pin */
#define EXTI_EXTICR4_EXTI12_PH         ((0x00000007U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PH[12] pin */
#define EXTI_EXTICR4_EXTI12_PI         ((0x00000008U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PI[12] pin */
#define EXTI_EXTICR4_EXTI12_PJ         ((0x00000009U)<<EXTI_EXTICR4_EXTI12_Pos)         /*!<PJ[12] pin */
/* No PK on EXTI12 */
/* No PZ on EXTI12 */

/**
  * @brief   EXTI13 configuration
  */
#define EXTI_EXTICR4_EXTI13_PA         ((0x00000000U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PA[13] pin */
#define EXTI_EXTICR4_EXTI13_PB         ((0x00000001U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PB[13] pin */
#define EXTI_EXTICR4_EXTI13_PC         ((0x00000002U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PC[13] pin */
#define EXTI_EXTICR4_EXTI13_PD         ((0x00000003U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PD[13] pin */
#define EXTI_EXTICR4_EXTI13_PE         ((0x00000004U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PE[13] pin */
#define EXTI_EXTICR4_EXTI13_PF         ((0x00000005U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PF[13] pin */
#define EXTI_EXTICR4_EXTI13_PG         ((0x00000006U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PG[13] pin */
#define EXTI_EXTICR4_EXTI13_PH         ((0x00000007U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PH[13] pin */
#define EXTI_EXTICR4_EXTI13_PI         ((0x00000008U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PI[13] pin */
#define EXTI_EXTICR4_EXTI13_PJ         ((0x00000009U)<<EXTI_EXTICR4_EXTI13_Pos)         /*!<PJ[13] pin */
/* No PK on EXTI13 */
/* No PZ on EXTI13 */

/**
  * @brief   EXTI14 configuration
  */
#define EXTI_EXTICR4_EXTI14_PA         ((0x00000000U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PA[14] pin */
#define EXTI_EXTICR4_EXTI14_PB         ((0x00000001U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PB[14] pin */
#define EXTI_EXTICR4_EXTI14_PC         ((0x00000002U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PC[14] pin */
#define EXTI_EXTICR4_EXTI14_PD         ((0x00000003U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PD[14] pin */
#define EXTI_EXTICR4_EXTI14_PE         ((0x00000004U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PE[14] pin */
#define EXTI_EXTICR4_EXTI14_PF         ((0x00000005U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PF[14] pin */
#define EXTI_EXTICR4_EXTI14_PG         ((0x00000006U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PG[14] pin */
#define EXTI_EXTICR4_EXTI14_PH         ((0x00000007U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PH[14] pin */
#define EXTI_EXTICR4_EXTI14_PI         ((0x00000008U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PI[14] pin */
#define EXTI_EXTICR4_EXTI14_PJ         ((0x00000009U)<<EXTI_EXTICR4_EXTI14_Pos)         /*!<PJ[14] pin */
/* No PK on EXTI14 */
/* No PZ on EXTI14 */

/**
  * @brief   EXTI15 configuration
  */
#define EXTI_EXTICR4_EXTI15_PA         ((0x00000000U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PA[15] pin */
#define EXTI_EXTICR4_EXTI15_PB         ((0x00000001U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PB[15] pin */
#define EXTI_EXTICR4_EXTI15_PC         ((0x00000002U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PC[15] pin */
#define EXTI_EXTICR4_EXTI15_PD         ((0x00000003U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PD[15] pin */
#define EXTI_EXTICR4_EXTI15_PE         ((0x00000004U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PE[15] pin */
#define EXTI_EXTICR4_EXTI15_PF         ((0x00000005U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PF[15] pin */
#define EXTI_EXTICR4_EXTI15_PG         ((0x00000006U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PG[15] pin */
#define EXTI_EXTICR4_EXTI15_PH         ((0x00000007U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PH[15] pin */
#define EXTI_EXTICR4_EXTI15_PI         ((0x00000008U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PI[15] pin */
#define EXTI_EXTICR4_EXTI15_PJ         ((0x00000009U)<<EXTI_EXTICR4_EXTI15_Pos)         /*!<PJ[15] pin */
/* No PK on EXTI15 */
/* No PZ on EXTI15 */

/******************  Bit definition for EXTI_LOCKR register  ***********************/
#define EXTI_LOCKR_GLOCK_Pos         (0U)
#define EXTI_LOCKR_GLOCK_Msk         (0x1UL << EXTI_LOCKR_GLOCK_Pos)
#define EXTI_LOCKR_GLOCK             EXTI_LOCKR_GLOCK_Msk                        /*!< global security locked */

/*******************  Bit definition for EXTI1 CmIMR1 register  *******************/
#define EXTI1_IMR1_IM0_Pos          (0U)
#define EXTI1_IMR1_IM0_Msk          (0x1UL << EXTI1_IMR1_IM0_Pos)                 /*!< 0x00000001 */
#define EXTI1_IMR1_IM0              EXTI1_IMR1_IM0_Msk                           /*!< Interrupt Mask on line 0 */
#define EXTI1_IMR1_IM1_Pos          (1U)
#define EXTI1_IMR1_IM1_Msk          (0x1UL << EXTI1_IMR1_IM1_Pos)                 /*!< 0x00000002 */
#define EXTI1_IMR1_IM1              EXTI1_IMR1_IM1_Msk                           /*!< Interrupt Mask on line 1 */
#define EXTI1_IMR1_IM2_Pos          (2U)
#define EXTI1_IMR1_IM2_Msk          (0x1UL << EXTI1_IMR1_IM2_Pos)                 /*!< 0x00000004 */
#define EXTI1_IMR1_IM2              EXTI1_IMR1_IM2_Msk                           /*!< Interrupt Mask on line 2 */
#define EXTI1_IMR1_IM3_Pos          (3U)
#define EXTI1_IMR1_IM3_Msk          (0x1UL << EXTI1_IMR1_IM3_Pos)                 /*!< 0x00000008 */
#define EXTI1_IMR1_IM3              EXTI1_IMR1_IM3_Msk                           /*!< Interrupt Mask on line 3 */
#define EXTI1_IMR1_IM4_Pos          (4U)
#define EXTI1_IMR1_IM4_Msk          (0x1UL << EXTI1_IMR1_IM4_Pos)                 /*!< 0x00000010 */
#define EXTI1_IMR1_IM4              EXTI1_IMR1_IM4_Msk                           /*!< Interrupt Mask on line 4 */
#define EXTI1_IMR1_IM5_Pos          (5U)
#define EXTI1_IMR1_IM5_Msk          (0x1UL << EXTI1_IMR1_IM5_Pos)                 /*!< 0x00000020 */
#define EXTI1_IMR1_IM5              EXTI1_IMR1_IM5_Msk                           /*!< Interrupt Mask on line 5 */
#define EXTI1_IMR1_IM6_Pos          (6U)
#define EXTI1_IMR1_IM6_Msk          (0x1UL << EXTI1_IMR1_IM6_Pos)                 /*!< 0x00000040 */
#define EXTI1_IMR1_IM6              EXTI1_IMR1_IM6_Msk                           /*!< Interrupt Mask on line 6 */
#define EXTI1_IMR1_IM7_Pos          (7U)
#define EXTI1_IMR1_IM7_Msk          (0x1UL << EXTI1_IMR1_IM7_Pos)                 /*!< 0x00000080 */
#define EXTI1_IMR1_IM7              EXTI1_IMR1_IM7_Msk                           /*!< Interrupt Mask on line 7 */
#define EXTI1_IMR1_IM8_Pos          (8U)
#define EXTI1_IMR1_IM8_Msk          (0x1UL << EXTI1_IMR1_IM8_Pos)                 /*!< 0x00000100 */
#define EXTI1_IMR1_IM8              EXTI1_IMR1_IM8_Msk                           /*!< Interrupt Mask on line 8 */
#define EXTI1_IMR1_IM9_Pos          (9U)
#define EXTI1_IMR1_IM9_Msk          (0x1UL << EXTI1_IMR1_IM9_Pos)                 /*!< 0x00000200 */
#define EXTI1_IMR1_IM9              EXTI1_IMR1_IM9_Msk                           /*!< Interrupt Mask on line 9 */
#define EXTI1_IMR1_IM10_Pos         (10U)
#define EXTI1_IMR1_IM10_Msk         (0x1UL << EXTI1_IMR1_IM10_Pos)                /*!< 0x00000400 */
#define EXTI1_IMR1_IM10             EXTI1_IMR1_IM10_Msk                          /*!< Interrupt Mask on line 10 */
#define EXTI1_IMR1_IM11_Pos         (11U)
#define EXTI1_IMR1_IM11_Msk         (0x1UL << EXTI1_IMR1_IM11_Pos)                /*!< 0x00000800 */
#define EXTI1_IMR1_IM11             EXTI1_IMR1_IM11_Msk                          /*!< Interrupt Mask on line 11 */
#define EXTI1_IMR1_IM12_Pos         (12U)
#define EXTI1_IMR1_IM12_Msk         (0x1UL << EXTI1_IMR1_IM12_Pos)                /*!< 0x00001000 */
#define EXTI1_IMR1_IM12             EXTI1_IMR1_IM12_Msk                          /*!< Interrupt Mask on line 12 */
#define EXTI1_IMR1_IM13_Pos         (13U)
#define EXTI1_IMR1_IM13_Msk         (0x1UL << EXTI1_IMR1_IM13_Pos)                /*!< 0x00002000 */
#define EXTI1_IMR1_IM13             EXTI1_IMR1_IM13_Msk                          /*!< Interrupt Mask on line 13 */
#define EXTI1_IMR1_IM14_Pos         (14U)
#define EXTI1_IMR1_IM14_Msk         (0x1UL << EXTI1_IMR1_IM14_Pos)                /*!< 0x00004000 */
#define EXTI1_IMR1_IM14             EXTI1_IMR1_IM14_Msk                          /*!< Interrupt Mask on line 14 */
#define EXTI1_IMR1_IM15_Pos         (15U)
#define EXTI1_IMR1_IM15_Msk         (0x1UL << EXTI1_IMR1_IM15_Pos)                /*!< 0x00008000 */
#define EXTI1_IMR1_IM15             EXTI1_IMR1_IM15_Msk                          /*!< Interrupt Mask on line 15 */
#define EXTI1_IMR1_IM16_Pos         (16U)
#define EXTI1_IMR1_IM16_Msk         (0x1UL << EXTI1_IMR1_IM16_Pos)                /*!< 0x00010000 */
#define EXTI1_IMR1_IM16             EXTI1_IMR1_IM16_Msk                          /*!< Interrupt Mask on line 16 */
#define EXTI1_IMR1_IM17_Pos         (17U)
#define EXTI1_IMR1_IM17_Msk         (0x1UL << EXTI1_IMR1_IM17_Pos)                /*!< 0x00020000 */
#define EXTI1_IMR1_IM17             EXTI1_IMR1_IM17_Msk                          /*!< Interrupt Mask on line 17 */
#define EXTI1_IMR1_IM18_Pos         (18U)
#define EXTI1_IMR1_IM18_Msk         (0x1UL << EXTI1_IMR1_IM18_Pos)                /*!< 0x00040000 */
#define EXTI1_IMR1_IM18             EXTI1_IMR1_IM18_Msk                          /*!< Interrupt Mask on line 18 */
#define EXTI1_IMR1_IM19_Pos         (19U)
#define EXTI1_IMR1_IM19_Msk         (0x1UL << EXTI1_IMR1_IM19_Pos)                /*!< 0x00080000 */
#define EXTI1_IMR1_IM19             EXTI1_IMR1_IM19_Msk                          /*!< Interrupt Mask on line 19 */
/* No interrupt line 20 */
#define EXTI1_IMR1_IM21_Pos         (21U)
#define EXTI1_IMR1_IM21_Msk         (0x1UL << EXTI1_IMR1_IM21_Pos)                /*!< 0x00200000 */
#define EXTI1_IMR1_IM21             EXTI1_IMR1_IM21_Msk                          /*!< Interrupt Mask on line 21 */
#define EXTI1_IMR1_IM22_Pos         (22U)
#define EXTI1_IMR1_IM22_Msk         (0x1UL << EXTI1_IMR1_IM22_Pos)                /*!< 0x00400000 */
#define EXTI1_IMR1_IM22             EXTI1_IMR1_IM22_Msk                          /*!< Interrupt Mask on line 22 */
#define EXTI1_IMR1_IM23_Pos         (23U)
#define EXTI1_IMR1_IM23_Msk         (0x1UL << EXTI1_IMR1_IM23_Pos)                /*!< 0x00800000 */
#define EXTI1_IMR1_IM23             EXTI1_IMR1_IM23_Msk                          /*!< Interrupt Mask on line 23 */
#define EXTI1_IMR1_IM24_Pos         (24U)
#define EXTI1_IMR1_IM24_Msk         (0x1UL << EXTI1_IMR1_IM24_Pos)                /*!< 0x01000000 */
#define EXTI1_IMR1_IM24             EXTI1_IMR1_IM24_Msk                          /*!< Interrupt Mask on line 24 */
#define EXTI1_IMR1_IM25_Pos         (25U)
#define EXTI1_IMR1_IM25_Msk         (0x1UL << EXTI1_IMR1_IM25_Pos)                /*!< 0x02000000 */
#define EXTI1_IMR1_IM25             EXTI1_IMR1_IM25_Msk                          /*!< Interrupt Mask on line 25 */
#define EXTI1_IMR1_IM26_Pos         (26U)
#define EXTI1_IMR1_IM26_Msk         (0x1UL << EXTI1_IMR1_IM26_Pos)                /*!< 0x04000000 */
#define EXTI1_IMR1_IM26             EXTI1_IMR1_IM26_Msk                          /*!< Interrupt Mask on line 26 */
#define EXTI1_IMR1_IM27_Pos         (27U)
#define EXTI1_IMR1_IM27_Msk         (0x1UL << EXTI1_IMR1_IM27_Pos)                /*!< 0x08000000 */
#define EXTI1_IMR1_IM27             EXTI1_IMR1_IM27_Msk                          /*!< Interrupt Mask on line 27 */
#define EXTI1_IMR1_IM28_Pos         (28U)
#define EXTI1_IMR1_IM28_Msk         (0x1UL << EXTI1_IMR1_IM28_Pos)                /*!< 0x10000000 */
#define EXTI1_IMR1_IM28             EXTI1_IMR1_IM28_Msk                          /*!< Interrupt Mask on line 28 */
#define EXTI1_IMR1_IM29_Pos         (29U)
#define EXTI1_IMR1_IM29_Msk         (0x1UL << EXTI1_IMR1_IM29_Pos)                /*!< 0x20000000 */
#define EXTI1_IMR1_IM29             EXTI1_IMR1_IM29_Msk                          /*!< Interrupt Mask on line 29 */
#define EXTI1_IMR1_IM30_Pos         (30U)
#define EXTI1_IMR1_IM30_Msk         (0x1UL << EXTI1_IMR1_IM30_Pos)                /*!< 0x40000000 */
#define EXTI1_IMR1_IM30             EXTI1_IMR1_IM30_Msk                          /*!< Interrupt Mask on line 30 */
#define EXTI1_IMR1_IM31_Pos         (31U)
#define EXTI1_IMR1_IM31_Msk         (0x1UL << EXTI1_IMR1_IM31_Pos)                /*!< 0x80000000 */
#define EXTI1_IMR1_IM31             EXTI1_IMR1_IM31_Msk                          /*!< Interrupt Mask on line 31 */

