STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_cm33.h
/****************  Bit definition for FMC_HECCR register  *****************/
#define FMC_HECCR_HECC_Pos            (0U)
#define FMC_HECCR_HECC_Msk            (0xFFFFFFFFUL << FMC_HECCR_HECC_Pos)    /*!< 0xFFFFFFFF */
#define FMC_HECCR_HECC                FMC_HECCR_HECC_Msk                     /*!< ECC result */

/****************  Bit definition for FMC_FMC_BWTRx register (x=1..4) *****/
#define FMC_BWTRx_ADDSET_Pos          (0U)
#define FMC_BWTRx_ADDSET_Msk          (0xFUL << FMC_BWTRx_ADDSET_Pos)         /*!< 0x0000000F */
#define FMC_BWTRx_ADDSET              FMC_BWTRx_ADDSET_Msk                   /*!< Address setup phase duration. */
#define FMC_BWTRx_ADDHLD_Pos          (4U)
#define FMC_BWTRx_ADDHLD_Msk          (0xFUL << FMC_BWTRx_ADDHLD_Pos)         /*!< 0x000000F0 */
#define FMC_BWTRx_ADDHLD              FMC_BWTRx_ADDHLD_Msk                   /*!< Address-hold phase duration. */
#define FMC_BWTRx_DATAST_Pos          (8U)
#define FMC_BWTRx_DATAST_Msk          (0xFFUL << FMC_BWTRx_DATAST_Pos)        /*!< 0x0000FF00 */
#define FMC_BWTRx_DATAST              FMC_BWTRx_DATAST_Msk                   /*!< Data-phase duration. */
#define FMC_BWTRx_BUSTURN_Pos         (16U)
#define FMC_BWTRx_BUSTURN_Msk         (0xFUL << FMC_BWTRx_BUSTURN_Pos)        /*!< 0x000F0000 */
#define FMC_BWTRx_BUSTURN             FMC_BWTRx_BUSTURN_Msk                  /*!< Bus turnaround phase duration */
#define FMC_BWTRx_ACCMOD_Pos          (28U)
#define FMC_BWTRx_ACCMOD_Msk          (0x3UL << FMC_BWTRx_ACCMOD_Pos)         /*!< 0x30000000 */
#define FMC_BWTRx_ACCMOD              FMC_BWTRx_ACCMOD_Msk                   /*!< Access mode. */
#define FMC_BWTRx_DATAHLD_Pos         (30U)
#define FMC_BWTRx_DATAHLD_Msk         (0x3UL << FMC_BWTRx_DATAHLD_Pos)        /*!< 0xC0000000 */
#define FMC_BWTRx_DATAHLD             FMC_BWTRx_DATAHLD_Msk                  /*!< Data Hold phase duration */

/*******************  Bit definition for FMC_IER register  ********************/
#define FMC_IER_IREE_Pos              (0U)
#define FMC_IER_IREE_Msk              (0x1UL << FMC_IER_IREE_Pos)             /*!< 0x00000001 */
#define FMC_IER_IREE                  FMC_IER_IREE_Msk                       /*!< Interrupt rising edge detection enable bit */
#define FMC_IER_IHLE_Pos              (1U)
#define FMC_IER_IHLE_Msk              (0x1UL << FMC_IER_IHLE_Pos)             /*!< 0x00000002 */
#define FMC_IER_IHLE                  FMC_IER_IHLE_Msk                       /*!< Interrupt high-level detection enable bit */
#define FMC_IER_IFEE_Pos              (2U)
#define FMC_IER_IFEE_Msk              (0x1UL << FMC_IER_IFEE_Pos)             /*!< 0x00000004 */
#define FMC_IER_IFEE                  FMC_IER_IFEE_Msk                       /*!< Interrupt falling edge detection enable bit */

/*******************  Bit definition for FMC_ISR register  ********************/
#define FMC_ISR_IREF_Pos              (0U)
#define FMC_ISR_IREF_Msk              (0x1UL << FMC_ISR_IREF_Pos)             /*!< 0x00000001 */
#define FMC_ISR_IREF                  FMC_ISR_IREF_Msk                       /*!< Interrupt rising edge flag */
#define FMC_ISR_IHLF_Pos              (1U)
#define FMC_ISR_IHLF_Msk              (0x1UL << FMC_ISR_IHLF_Pos)             /*!< 0x00000002 */
#define FMC_ISR_IHLF                  FMC_ISR_IHLF_Msk                       /*!< Interrupt high-level flag */
#define FMC_ISR_IFEF_Pos              (2U)
#define FMC_ISR_IFEF_Msk              (0x1UL << FMC_ISR_IFEF_Pos)             /*!< 0x00000004 */
#define FMC_ISR_IFEF                  FMC_ISR_IFEF_Msk                       /*!< Interrupt falling edge flag */

/*******************  Bit definition for FMC_ICR register  ********************/
#define FMC_ICR_CIREF_Pos             (0U)
#define FMC_ICR_CIREF_Msk             (0x1UL << FMC_ICR_CIREF_Pos)            /*!< 0x00000001 */
#define FMC_ICR_CIREF                 FMC_ICR_CIREF_Msk                      /*!< Clear Interrupt rising edge flag */
#define FMC_ICR_CIHLF_Pos             (1U)
#define FMC_ICR_CIHLF_Msk             (0x1UL << FMC_ICR_CIHLF_Pos)            /*!< 0x00000002 */
#define FMC_ICR_CIHLF                 FMC_ICR_CIHLF_Msk                      /*!< Clear Interrupt high-level flag */
#define FMC_ICR_CIFEF_Pos             (2U)
#define FMC_ICR_CIFEF_Msk             (0x1UL << FMC_ICR_CIFEF_Pos)            /*!< 0x00000004 */
#define FMC_ICR_CIFEF                 FMC_ICR_CIFEF_Msk                      /*!< Clear Interrupt falling edge flag */

/****************  Bit definition for FMC_CSQCR register  *****************/
#define FMC_CSQCR_CSQSTART_Pos        (0U)
#define FMC_CSQCR_CSQSTART_Msk        (0x1UL << FMC_CSQCR_CSQSTART_Pos)       /*!< 0x00000001 */
#define FMC_CSQCR_CSQSTART            FMC_CSQCR_CSQSTART_Msk                 /*!< Command Sequencer Enable */

/***************  Bit definition for FMC_CSQCFGR1 register  ***************/
#define FMC_CSQCFGR1_CMD2EN_Pos       (1U)
#define FMC_CSQCFGR1_CMD2EN_Msk       (0x1UL << FMC_CSQCFGR1_CMD2EN_Pos)      /*!< 0x00000002 */
#define FMC_CSQCFGR1_CMD2EN           FMC_CSQCFGR1_CMD2EN_Msk                /*!< Command cycle 2 Enable */
#define FMC_CSQCFGR1_DMADEN_Pos       (2U)
#define FMC_CSQCFGR1_DMADEN_Msk       (0x1UL << FMC_CSQCFGR1_DMADEN_Pos)      /*!< 0x00000004 */
#define FMC_CSQCFGR1_DMADEN           FMC_CSQCFGR1_DMADEN_Msk                /*!< Command sequencer DMA request data enable */
#define FMC_CSQCFGR1_ACYNBR_Pos       (4U)
#define FMC_CSQCFGR1_ACYNBR_Msk       (0x7UL << FMC_CSQCFGR1_ACYNBR_Pos)      /*!< 0x00000070 */
#define FMC_CSQCFGR1_ACYNBR           FMC_CSQCFGR1_ACYNBR_Msk                /*!< Address Cycle number */
#define FMC_CSQCFGR1_CMD1_Pos         (8U)
#define FMC_CSQCFGR1_CMD1_Msk         (0xFFUL << FMC_CSQCFGR1_CMD1_Pos)       /*!< 0x0000FF00 */
#define FMC_CSQCFGR1_CMD1             FMC_CSQCFGR1_CMD1_Msk                  /*!< Command 1 sequencer */
#define FMC_CSQCFGR1_CMD2_Pos         (16U)
#define FMC_CSQCFGR1_CMD2_Msk         (0xFFUL << FMC_CSQCFGR1_CMD2_Pos)       /*!< 0x00FF0000 */
#define FMC_CSQCFGR1_CMD2             FMC_CSQCFGR1_CMD2_Msk                  /*!< Command 2 sequencer */
#define FMC_CSQCFGR1_CMD1T_Pos        (24U)
#define FMC_CSQCFGR1_CMD1T_Msk        (0x1UL << FMC_CSQCFGR1_CMD1T_Pos)       /*!< 0x01000000 */
#define FMC_CSQCFGR1_CMD1T            FMC_CSQCFGR1_CMD1T_Msk                 /*!< Command 1 Sequencer timings */
#define FMC_CSQCFGR1_CMD2T_Pos        (25U)
#define FMC_CSQCFGR1_CMD2T_Msk        (0x1UL << FMC_CSQCFGR1_CMD2T_Pos)       /*!< 0x02000000 */
#define FMC_CSQCFGR1_CMD2T            FMC_CSQCFGR1_CMD2T_Msk                 /*!< Command 2 Sequencer timings */

