STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_cm33.h
/* Bit fields for RCC_SYSRAMCFGR register */
#define RCC_SYSRAMCFGR_SYSRAMEN_Pos                  (1U)
#define RCC_SYSRAMCFGR_SYSRAMEN_Msk                  (0x1UL << RCC_SYSRAMCFGR_SYSRAMEN_Pos)                 /*!< 0x00000002 */
#define RCC_SYSRAMCFGR_SYSRAMEN                      RCC_SYSRAMCFGR_SYSRAMEN_Msk                           /*!< SYSRAM clock enable */
#define RCC_SYSRAMCFGR_SYSRAMLPEN_Pos                (2U)
#define RCC_SYSRAMCFGR_SYSRAMLPEN_Msk                (0x1UL << RCC_SYSRAMCFGR_SYSRAMLPEN_Pos)               /*!< 0x00000004 */
#define RCC_SYSRAMCFGR_SYSRAMLPEN                    RCC_SYSRAMCFGR_SYSRAMLPEN_Msk                         /*!< SYSRAM clock enable during CSleep */

/* Bit fields for RCC_VDERAMCFGR register */
#define RCC_VDERAMCFGR_VDERAMEN_Pos                  (1U)
#define RCC_VDERAMCFGR_VDERAMEN_Msk                  (0x1UL << RCC_VDERAMCFGR_VDERAMEN_Pos)                 /*!< 0x00000002 */
#define RCC_VDERAMCFGR_VDERAMEN                      RCC_VDERAMCFGR_VDERAMEN_Msk                           /*!< VDERAM clock enable */
#define RCC_VDERAMCFGR_VDERAMLPEN_Pos                (2U)
#define RCC_VDERAMCFGR_VDERAMLPEN_Msk                (0x1UL << RCC_VDERAMCFGR_VDERAMLPEN_Pos)               /*!< 0x00000004 */
#define RCC_VDERAMCFGR_VDERAMLPEN                    RCC_VDERAMCFGR_VDERAMLPEN_Msk                         /*!< VDERAM clock enable during CSleep */

/* Bit fields for RCC_SRAM1CFGR register */
#define RCC_SRAM1CFGR_SRAM1EN_Pos                    (1U)
#define RCC_SRAM1CFGR_SRAM1EN_Msk                    (0x1UL << RCC_SRAM1CFGR_SRAM1EN_Pos)                   /*!< 0x00000002 */
#define RCC_SRAM1CFGR_SRAM1EN                        RCC_SRAM1CFGR_SRAM1EN_Msk                             /*!< SRAM1 clock enable */
#define RCC_SRAM1CFGR_SRAM1LPEN_Pos                  (2U)
#define RCC_SRAM1CFGR_SRAM1LPEN_Msk                  (0x1UL << RCC_SRAM1CFGR_SRAM1LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SRAM1CFGR_SRAM1LPEN                      RCC_SRAM1CFGR_SRAM1LPEN_Msk                           /*!< SRAM1 clock enable during CSleep */

/* Bit fields for RCC_SRAM2CFGR register */
#define RCC_SRAM2CFGR_SRAM2EN_Pos                    (1U)
#define RCC_SRAM2CFGR_SRAM2EN_Msk                    (0x1UL << RCC_SRAM2CFGR_SRAM2EN_Pos)                   /*!< 0x00000002 */
#define RCC_SRAM2CFGR_SRAM2EN                        RCC_SRAM2CFGR_SRAM2EN_Msk                             /*!< SRAM2 clock enable */
#define RCC_SRAM2CFGR_SRAM2LPEN_Pos                  (2U)
#define RCC_SRAM2CFGR_SRAM2LPEN_Msk                  (0x1UL << RCC_SRAM2CFGR_SRAM2LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SRAM2CFGR_SRAM2LPEN                      RCC_SRAM2CFGR_SRAM2LPEN_Msk                           /*!< SRAM2 clock enable during CSleep */

/* Bit fields for RCC_RETRAMCFGR register */
#define RCC_RETRAMCFGR_RETRAMEN_Pos                  (1U)
#define RCC_RETRAMCFGR_RETRAMEN_Msk                  (0x1UL << RCC_RETRAMCFGR_RETRAMEN_Pos)                 /*!< 0x00000002 */
#define RCC_RETRAMCFGR_RETRAMEN                      RCC_RETRAMCFGR_RETRAMEN_Msk                           /*!< RETRAM clock enable */
#define RCC_RETRAMCFGR_RETRAMLPEN_Pos                (2U)
#define RCC_RETRAMCFGR_RETRAMLPEN_Msk                (0x1UL << RCC_RETRAMCFGR_RETRAMLPEN_Pos)               /*!< 0x00000004 */
#define RCC_RETRAMCFGR_RETRAMLPEN                    RCC_RETRAMCFGR_RETRAMLPEN_Msk                         /*!< RETRAM clock enable during CSleep */

/* Bit fields for RCC_BKPSRAMCFGR register */
#define RCC_BKPSRAMCFGR_BKPSRAMEN_Pos                (1U)
#define RCC_BKPSRAMCFGR_BKPSRAMEN_Msk                (0x1UL << RCC_BKPSRAMCFGR_BKPSRAMEN_Pos)               /*!< 0x00000002 */
#define RCC_BKPSRAMCFGR_BKPSRAMEN                    RCC_BKPSRAMCFGR_BKPSRAMEN_Msk                         /*!< BKPSRAM clock enable */
#define RCC_BKPSRAMCFGR_BKPSRAMLPEN_Pos              (2U)
#define RCC_BKPSRAMCFGR_BKPSRAMLPEN_Msk              (0x1UL << RCC_BKPSRAMCFGR_BKPSRAMLPEN_Pos)             /*!< 0x00000004 */
#define RCC_BKPSRAMCFGR_BKPSRAMLPEN                  RCC_BKPSRAMCFGR_BKPSRAMLPEN_Msk                       /*!< BKPSRAM clock enable during CSleep */

/* Bit fields for RCC_LPSRAM1CFGR register */
#define RCC_LPSRAM1CFGR_LPSRAM1EN_Pos                (1U)
#define RCC_LPSRAM1CFGR_LPSRAM1EN_Msk                (0x1UL << RCC_LPSRAM1CFGR_LPSRAM1EN_Pos)               /*!< 0x00000002 */
#define RCC_LPSRAM1CFGR_LPSRAM1EN                    RCC_LPSRAM1CFGR_LPSRAM1EN_Msk                         /*!< LPSRAM1 clock enable */
#define RCC_LPSRAM1CFGR_LPSRAM1LPEN_Pos              (2U)
#define RCC_LPSRAM1CFGR_LPSRAM1LPEN_Msk              (0x1UL << RCC_LPSRAM1CFGR_LPSRAM1LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPSRAM1CFGR_LPSRAM1LPEN                  RCC_LPSRAM1CFGR_LPSRAM1LPEN_Msk                       /*!< LPSRAM1 clock enable during CSleep */
#define RCC_LPSRAM1CFGR_LPSRAM1AMEN_Pos              (3U)
#define RCC_LPSRAM1CFGR_LPSRAM1AMEN_Msk              (0x1UL << RCC_LPSRAM1CFGR_LPSRAM1AMEN_Pos)             /*!< 0x00000008 */
#define RCC_LPSRAM1CFGR_LPSRAM1AMEN                  RCC_LPSRAM1CFGR_LPSRAM1AMEN_Msk                       /*!< LPSRAM1 autonomous clock mode enable */

/* Bit fields for RCC_LPSRAM2CFGR register */
#define RCC_LPSRAM2CFGR_LPSRAM2EN_Pos                (1U)
#define RCC_LPSRAM2CFGR_LPSRAM2EN_Msk                (0x1UL << RCC_LPSRAM2CFGR_LPSRAM2EN_Pos)               /*!< 0x00000002 */
#define RCC_LPSRAM2CFGR_LPSRAM2EN                    RCC_LPSRAM2CFGR_LPSRAM2EN_Msk                         /*!< LPSRAM2 clock enable */
#define RCC_LPSRAM2CFGR_LPSRAM2LPEN_Pos              (2U)
#define RCC_LPSRAM2CFGR_LPSRAM2LPEN_Msk              (0x1UL << RCC_LPSRAM2CFGR_LPSRAM2LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPSRAM2CFGR_LPSRAM2LPEN                  RCC_LPSRAM2CFGR_LPSRAM2LPEN_Msk                       /*!< LPSRAM2 clock enable during CSleep */
#define RCC_LPSRAM2CFGR_LPSRAM2AMEN_Pos              (3U)
#define RCC_LPSRAM2CFGR_LPSRAM2AMEN_Msk              (0x1UL << RCC_LPSRAM2CFGR_LPSRAM2AMEN_Pos)             /*!< 0x00000008 */
#define RCC_LPSRAM2CFGR_LPSRAM2AMEN                  RCC_LPSRAM2CFGR_LPSRAM2AMEN_Msk                       /*!< LPSRAM2 autonomous clock mode enable */

/* Bit fields for RCC_LPSRAM3CFGR register */
#define RCC_LPSRAM3CFGR_LPSRAM3EN_Pos                (1U)
#define RCC_LPSRAM3CFGR_LPSRAM3EN_Msk                (0x1UL << RCC_LPSRAM3CFGR_LPSRAM3EN_Pos)               /*!< 0x00000002 */
#define RCC_LPSRAM3CFGR_LPSRAM3EN                    RCC_LPSRAM3CFGR_LPSRAM3EN_Msk                         /*!< LPSRAM3 clock enable */
#define RCC_LPSRAM3CFGR_LPSRAM3LPEN_Pos              (2U)
#define RCC_LPSRAM3CFGR_LPSRAM3LPEN_Msk              (0x1UL << RCC_LPSRAM3CFGR_LPSRAM3LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPSRAM3CFGR_LPSRAM3LPEN                  RCC_LPSRAM3CFGR_LPSRAM3LPEN_Msk                       /*!< LPSRAM3 clock enable during CSleep */
#define RCC_LPSRAM3CFGR_LPSRAM3AMEN_Pos              (3U)
#define RCC_LPSRAM3CFGR_LPSRAM3AMEN_Msk              (0x1UL << RCC_LPSRAM3CFGR_LPSRAM3AMEN_Pos)             /*!< 0x00000008 */
#define RCC_LPSRAM3CFGR_LPSRAM3AMEN                  RCC_LPSRAM3CFGR_LPSRAM3AMEN_Msk                       /*!< LPSRAM3 autonomous clock mode enable */

/* Bit fields for RCC_OSPI1CFGR register */
#define RCC_OSPI1CFGR_OSPI1RST_Pos                   (0U)
#define RCC_OSPI1CFGR_OSPI1RST_Msk                   (0x1UL << RCC_OSPI1CFGR_OSPI1RST_Pos)                  /*!< 0x00000001 */
#define RCC_OSPI1CFGR_OSPI1RST                       RCC_OSPI1CFGR_OSPI1RST_Msk                            /*!< OCTOSPI1 reset */
#define RCC_OSPI1CFGR_OSPI1EN_Pos                    (1U)
#define RCC_OSPI1CFGR_OSPI1EN_Msk                    (0x1UL << RCC_OSPI1CFGR_OSPI1EN_Pos)                   /*!< 0x00000002 */
#define RCC_OSPI1CFGR_OSPI1EN                        RCC_OSPI1CFGR_OSPI1EN_Msk                             /*!< OCTOSPI1 and OTFDEC1 clock enable */
#define RCC_OSPI1CFGR_OSPI1LPEN_Pos                  (2U)
#define RCC_OSPI1CFGR_OSPI1LPEN_Msk                  (0x1UL << RCC_OSPI1CFGR_OSPI1LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_OSPI1CFGR_OSPI1LPEN                      RCC_OSPI1CFGR_OSPI1LPEN_Msk                           /*!< OCTOSPI1, OTFDEC1 and OCTOSPI1 delay (DLYBOSPI1) clock enable duringï¿½CSleep */
#define RCC_OSPI1CFGR_OTFDEC1RST_Pos                 (8U)
#define RCC_OSPI1CFGR_OTFDEC1RST_Msk                 (0x1UL << RCC_OSPI1CFGR_OTFDEC1RST_Pos)                /*!< 0x00000100 */
#define RCC_OSPI1CFGR_OTFDEC1RST                     RCC_OSPI1CFGR_OTFDEC1RST_Msk                          /*!< OTFDEC1 reset */
#define RCC_OSPI1CFGR_OSPI1DLLRST_Pos                (16U)
#define RCC_OSPI1CFGR_OSPI1DLLRST_Msk                (0x1UL << RCC_OSPI1CFGR_OSPI1DLLRST_Pos)               /*!< 0x00010000 */
#define RCC_OSPI1CFGR_OSPI1DLLRST                    RCC_OSPI1CFGR_OSPI1DLLRST_Msk                         /*!< OCTOSPI1 DLL reset */

/* Bit fields for RCC_OSPI2CFGR register */
#define RCC_OSPI2CFGR_OSPI2RST_Pos                   (0U)
#define RCC_OSPI2CFGR_OSPI2RST_Msk                   (0x1UL << RCC_OSPI2CFGR_OSPI2RST_Pos)                  /*!< 0x00000001 */
#define RCC_OSPI2CFGR_OSPI2RST                       RCC_OSPI2CFGR_OSPI2RST_Msk                            /*!< OCTOSPI2 reset */
#define RCC_OSPI2CFGR_OSPI2EN_Pos                    (1U)
#define RCC_OSPI2CFGR_OSPI2EN_Msk                    (0x1UL << RCC_OSPI2CFGR_OSPI2EN_Pos)                   /*!< 0x00000002 */
#define RCC_OSPI2CFGR_OSPI2EN                        RCC_OSPI2CFGR_OSPI2EN_Msk                             /*!< OCTOSPI2 and OTFDEC2 clock enable */
#define RCC_OSPI2CFGR_OSPI2LPEN_Pos                  (2U)
#define RCC_OSPI2CFGR_OSPI2LPEN_Msk                  (0x1UL << RCC_OSPI2CFGR_OSPI2LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_OSPI2CFGR_OSPI2LPEN                      RCC_OSPI2CFGR_OSPI2LPEN_Msk                           /*!< OCTOSPI2 and OTFDEC2 clock enable during CSleep */
#define RCC_OSPI2CFGR_OTFDEC2RST_Pos                 (8U)
#define RCC_OSPI2CFGR_OTFDEC2RST_Msk                 (0x1UL << RCC_OSPI2CFGR_OTFDEC2RST_Pos)                /*!< 0x00000100 */
#define RCC_OSPI2CFGR_OTFDEC2RST                     RCC_OSPI2CFGR_OTFDEC2RST_Msk                          /*!< OTFDEC2 reset */
#define RCC_OSPI2CFGR_OSPI2DLLRST_Pos                (16U)
#define RCC_OSPI2CFGR_OSPI2DLLRST_Msk                (0x1UL << RCC_OSPI2CFGR_OSPI2DLLRST_Pos)               /*!< 0x00010000 */
#define RCC_OSPI2CFGR_OSPI2DLLRST                    RCC_OSPI2CFGR_OSPI2DLLRST_Msk                         /*!< OCTOSPI2 DLL reset */


