STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_cm33.h
/* Bit fields for RCC_FMCCFGR register */
#define RCC_FMCCFGR_FMCRST_Pos                       (0U)
#define RCC_FMCCFGR_FMCRST_Msk                       (0x1UL << RCC_FMCCFGR_FMCRST_Pos)                      /*!< 0x00000001 */
#define RCC_FMCCFGR_FMCRST                           RCC_FMCCFGR_FMCRST_Msk                                /*!< FMC reset */
#define RCC_FMCCFGR_FMCEN_Pos                        (1U)
#define RCC_FMCCFGR_FMCEN_Msk                        (0x1UL << RCC_FMCCFGR_FMCEN_Pos)                       /*!< 0x00000002 */
#define RCC_FMCCFGR_FMCEN                            RCC_FMCCFGR_FMCEN_Msk                                 /*!< FMC clock enable */
#define RCC_FMCCFGR_FMCLPEN_Pos                      (2U)
#define RCC_FMCCFGR_FMCLPEN_Msk                      (0x1UL << RCC_FMCCFGR_FMCLPEN_Pos)                     /*!< 0x00000004 */
#define RCC_FMCCFGR_FMCLPEN                          RCC_FMCCFGR_FMCLPEN_Msk                               /*!< FMC clock enable during CSleep */

/* Bit fields for RCC_DBGCFGR register */
#define RCC_DBGCFGR_DBGEN_Pos                        (8U)
#define RCC_DBGCFGR_DBGEN_Msk                        (0x1UL << RCC_DBGCFGR_DBGEN_Pos)                       /*!< 0x00000100 */
#define RCC_DBGCFGR_DBGEN                            RCC_DBGCFGR_DBGEN_Msk                                 /*!< Debug function clock enable  */
#define RCC_DBGCFGR_TRACEEN_Pos                      (9U)
#define RCC_DBGCFGR_TRACEEN_Msk                      (0x1UL << RCC_DBGCFGR_TRACEEN_Pos)                     /*!< 0x00000200 */
#define RCC_DBGCFGR_TRACEEN                          RCC_DBGCFGR_TRACEEN_Msk                               /*!< Clock enable for trace port interface */
#define RCC_DBGCFGR_DBGRST_Pos                       (12U)
#define RCC_DBGCFGR_DBGRST_Msk                       (0x1UL << RCC_DBGCFGR_DBGRST_Pos)                      /*!< 0x00001000 */
#define RCC_DBGCFGR_DBGRST                           RCC_DBGCFGR_DBGRST_Msk                                /*!< Debug function reset */

/*****************  Bit definition for RCC_STMCFGR register  ******************/
#define RCC_STMCFGR_STMEN_Pos                        (1U)
#define RCC_STMCFGR_STMEN_Msk                        (0x1UL << RCC_STMCFGR_STMEN_Pos)                       /*!< 0x00000002 */
#define RCC_STMCFGR_STMEN                            RCC_STMCFGR_STMEN_Msk                                 /*!< STM clock enable */
#define RCC_STMCFGR_STMLPEN_Pos                      (2U)
#define RCC_STMCFGR_STMLPEN_Msk                      (0x1UL << RCC_STMCFGR_STMLPEN_Pos)                     /*!< 0x00000004 */
#define RCC_STMCFGR_STMLPEN                          RCC_STMCFGR_STMLPEN_Msk                               /*!< STM clock enable during CSleep */

/* Bit fields for RCC_ETRCFGR register */
#define RCC_ETRCFGR_ETREN_Pos                        (1U)
#define RCC_ETRCFGR_ETREN_Msk                        (0x1UL << RCC_ETRCFGR_ETREN_Pos)                       /*!< 0x00000002 */
#define RCC_ETRCFGR_ETREN                            RCC_ETRCFGR_ETREN_Msk                                 /*!< ETR clocks enable */
#define RCC_ETRCFGR_ETRLPEN_Pos                      (2U)
#define RCC_ETRCFGR_ETRLPEN_Msk                      (0x1UL << RCC_ETRCFGR_ETRLPEN_Pos)                     /*!< 0x00000004 */
#define RCC_ETRCFGR_ETRLPEN                          RCC_ETRCFGR_ETRLPEN_Msk                               /*!< ETR clock enable during CSleep */

/* Bit fields for RCC_GPIOACFGR register */
#define RCC_GPIOACFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOACFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOACFGR_GPIOxRST_Pos)
#define RCC_GPIOACFGR_GPIOxRST                       RCC_GPIOACFGR_GPIOxRST_Msk
#define RCC_GPIOACFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOACFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOACFGR_GPIOxEN_Pos)
#define RCC_GPIOACFGR_GPIOxEN                        RCC_GPIOACFGR_GPIOxEN_Msk
#define RCC_GPIOACFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOACFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOACFGR_GPIOxLPEN_Pos)
#define RCC_GPIOACFGR_GPIOxLPEN                      RCC_GPIOACFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOBCFGR register */
#define RCC_GPIOBCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOBCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOBCFGR_GPIOxRST_Pos)
#define RCC_GPIOBCFGR_GPIOxRST                       RCC_GPIOBCFGR_GPIOxRST_Msk
#define RCC_GPIOBCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOBCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOBCFGR_GPIOxEN_Pos)
#define RCC_GPIOBCFGR_GPIOxEN                        RCC_GPIOBCFGR_GPIOxEN_Msk
#define RCC_GPIOBCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOBCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOBCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOBCFGR_GPIOxLPEN                      RCC_GPIOBCFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIOCCFGR register */
#define RCC_GPIOCCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIOCCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIOCCFGR_GPIOxRST_Pos)
#define RCC_GPIOCCFGR_GPIOxRST                       RCC_GPIOCCFGR_GPIOxRST_Msk
#define RCC_GPIOCCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIOCCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIOCCFGR_GPIOxEN_Pos)
#define RCC_GPIOCCFGR_GPIOxEN                        RCC_GPIOCCFGR_GPIOxEN_Msk
#define RCC_GPIOCCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIOCCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIOCCFGR_GPIOxLPEN_Pos)
#define RCC_GPIOCCFGR_GPIOxLPEN                      RCC_GPIOCCFGR_GPIOxLPEN_Msk

/* Bit fields for RCC_GPIODCFGR register */
#define RCC_GPIODCFGR_GPIOxRST_Pos                   (0U)
#define RCC_GPIODCFGR_GPIOxRST_Msk                   (0x1UL << RCC_GPIODCFGR_GPIOxRST_Pos)
#define RCC_GPIODCFGR_GPIOxRST                       RCC_GPIODCFGR_GPIOxRST_Msk
#define RCC_GPIODCFGR_GPIOxEN_Pos                    (1U)
#define RCC_GPIODCFGR_GPIOxEN_Msk                    (0x1UL << RCC_GPIODCFGR_GPIOxEN_Pos)
#define RCC_GPIODCFGR_GPIOxEN                        RCC_GPIODCFGR_GPIOxEN_Msk
#define RCC_GPIODCFGR_GPIOxLPEN_Pos                  (2U)
#define RCC_GPIODCFGR_GPIOxLPEN_Msk                  (0x1UL << RCC_GPIODCFGR_GPIOxLPEN_Pos)
#define RCC_GPIODCFGR_GPIOxLPEN                      RCC_GPIODCFGR_GPIOxLPEN_Msk

