STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_cm33.h
/*******************  Bits definition for IAC_IER2 register *******************/
#define IAC_IER2_IAIE64_Pos           (0U)
#define IAC_IER2_IAIE64_Msk           (0x1UL << IAC_IER2_IAIE64_Pos)             /*!< 0x00000001 */
#define IAC_IER2_IAIE64               IAC_IER2_IAIE64_Msk
#define IAC_IER2_IAIE65_Pos           (1U)
#define IAC_IER2_IAIE65_Msk           (0x1UL << IAC_IER2_IAIE65_Pos)             /*!< 0x00000002 */
#define IAC_IER2_IAIE65               IAC_IER2_IAIE65_Msk
#define IAC_IER2_IAIE66_Pos           (2U)
#define IAC_IER2_IAIE66_Msk           (0x1UL << IAC_IER2_IAIE66_Pos)             /*!< 0x00000004 */
#define IAC_IER2_IAIE66               IAC_IER2_IAIE66_Msk
#define IAC_IER2_IAIE67_Pos           (3U)
#define IAC_IER2_IAIE67_Msk           (0x1UL << IAC_IER2_IAIE67_Pos)             /*!< 0x00000008 */
#define IAC_IER2_IAIE67               IAC_IER2_IAIE67_Msk
#define IAC_IER2_IAIE68_Pos           (4U)
#define IAC_IER2_IAIE68_Msk           (0x1UL << IAC_IER2_IAIE68_Pos)             /*!< 0x00000010 */
#define IAC_IER2_IAIE68               IAC_IER2_IAIE68_Msk
#define IAC_IER2_IAIE69_Pos           (5U)
#define IAC_IER2_IAIE69_Msk           (0x1UL << IAC_IER2_IAIE69_Pos)             /*!< 0x00000020 */
#define IAC_IER2_IAIE69               IAC_IER2_IAIE69_Msk
#define IAC_IER2_IAIE70_Pos           (6U)
#define IAC_IER2_IAIE70_Msk           (0x1UL << IAC_IER2_IAIE70_Pos)             /*!< 0x00000040 */
#define IAC_IER2_IAIE70               IAC_IER2_IAIE70_Msk
#define IAC_IER2_IAIE71_Pos           (7U)
#define IAC_IER2_IAIE71_Msk           (0x1UL << IAC_IER2_IAIE71_Pos)             /*!< 0x00000080 */
#define IAC_IER2_IAIE71                IAC_IER2_IAIE71_Msk
#define IAC_IER2_IAIE72_Pos           (8U)
#define IAC_IER2_IAIE72_Msk           (0x1UL << IAC_IER2_IAIE72_Pos)             /*!< 0x00000100 */
#define IAC_IER2_IAIE72               IAC_IER2_IAIE72_Msk
#define IAC_IER2_IAIE73_Pos           (9U)
#define IAC_IER2_IAIE73_Msk           (0x1UL << IAC_IER2_IAIE73_Pos)             /*!< 0x00000200 */
#define IAC_IER2_IAIE73               IAC_IER2_IAIE73_Msk
#define IAC_IER2_IAIE74_Pos           (10U)
#define IAC_IER2_IAIE74_Msk           (0x1UL << IAC_IER2_IAIE74_Pos)             /*!< 0x00000400 */
#define IAC_IER2_IAIE74               IAC_IER2_IAIE74_Msk
#define IAC_IER2_IAIE75_Pos           (11U)
#define IAC_IER2_IAIE75_Msk           (0x1UL << IAC_IER2_IAIE75_Pos)             /*!< 0x00000800 */
#define IAC_IER2_IAIE75               IAC_IER2_IAIE75_Msk
#define IAC_IER2_IAIE76_Pos           (12U)
#define IAC_IER2_IAIE76_Msk           (0x1UL << IAC_IER2_IAIE76_Pos)             /*!< 0x00001000 */
#define IAC_IER2_IAIE76               IAC_IER2_IAIE76_Msk
#define IAC_IER2_IAIE77_Pos           (13U)
#define IAC_IER2_IAIE77_Msk           (0x1UL << IAC_IER2_IAIE77_Pos)             /*!< 0x00002000 */
#define IAC_IER2_IAIE77               IAC_IER2_IAIE77_Msk
#define IAC_IER2_IAIE78_Pos           (14U)
#define IAC_IER2_IAIE78_Msk           (0x1UL << IAC_IER2_IAIE78_Pos)             /*!< 0x00004000 */
#define IAC_IER2_IAIE78               IAC_IER2_IAIE78_Msk
#define IAC_IER2_IAIE79_Pos           (15U)
#define IAC_IER2_IAIE79_Msk           (0x1UL << IAC_IER2_IAIE79_Pos)             /*!< 0x00008000 */
#define IAC_IER2_IAIE79               IAC_IER2_IAIE79_Msk
#define IAC_IER2_IAIE80_Pos           (16U)
#define IAC_IER2_IAIE80_Msk           (0x1UL << IAC_IER2_IAIE80_Pos)             /*!< 0x00010000 */
#define IAC_IER2_IAIE80               IAC_IER2_IAIE80_Msk
#define IAC_IER2_IAIE81_Pos           (17U)
#define IAC_IER2_IAIE81_Msk           (0x1UL << IAC_IER2_IAIE81_Pos)             /*!< 0x00020000 */
#define IAC_IER2_IAIE81               IAC_IER2_IAIE81_Msk
#define IAC_IER2_IAIE82_Pos           (18U)
#define IAC_IER2_IAIE82_Msk           (0x1UL << IAC_IER2_IAIE82_Pos)             /*!< 0x00040000 */
#define IAC_IER2_IAIE82               IAC_IER2_IAIE82_Msk
#define IAC_IER2_IAIE83_Pos           (19U)
#define IAC_IER2_IAIE83_Msk           (0x1UL << IAC_IER2_IAIE83_Pos)             /*!< 0x00080000 */
#define IAC_IER2_IAIE83               IAC_IER2_IAIE83_Msk
#define IAC_IER2_IAIE84_Pos           (20U)
#define IAC_IER2_IAIE84_Msk           (0x1UL << IAC_IER2_IAIE84_Pos)             /*!< 0x00100000 */
#define IAC_IER2_IAIE84               IAC_IER2_IAIE84_Msk
#define IAC_IER2_IAIE85_Pos           (21U)
#define IAC_IER2_IAIE85_Msk           (0x1UL << IAC_IER2_IAIE85_Pos)             /*!< 0x00200000 */
#define IAC_IER2_IAIE85               IAC_IER2_IAIE85_Msk
#define IAC_IER2_IAIE86_Pos           (22U)
#define IAC_IER2_IAIE86_Msk           (0x1UL << IAC_IER2_IAIE86_Pos)             /*!< 0x00400000 */
#define IAC_IER2_IAIE86               IAC_IER2_IAIE86_Msk
#define IAC_IER2_IAIE87_Pos           (23U)
#define IAC_IER2_IAIE87_Msk           (0x1UL << IAC_IER2_IAIE87_Pos)             /*!< 0x00800000 */
#define IAC_IER2_IAIE87               IAC_IER2_IAIE87_Msk
#define IAC_IER2_IAIE88_Pos           (24U)
#define IAC_IER2_IAIE88_Msk           (0x1UL << IAC_IER2_IAIE88_Pos)             /*!< 0x01000000 */
#define IAC_IER2_IAIE88               IAC_IER2_IAIE88_Msk
#define IAC_IER2_IAIE89_Pos           (25U)
#define IAC_IER2_IAIE89_Msk           (0x1UL << IAC_IER2_IAIE89_Pos)             /*!< 0x02000000 */
#define IAC_IER2_IAIE89               IAC_IER2_IAIE89_Msk
#define IAC_IER2_IAIE90_Pos           (26U)
#define IAC_IER2_IAIE90_Msk           (0x1UL << IAC_IER2_IAIE90_Pos)             /*!< 0x04000000 */
#define IAC_IER2_IAIE90               IAC_IER2_IAIE90_Msk
#define IAC_IER2_IAIE91_Pos           (27U)
#define IAC_IER2_IAIE91_Msk           (0x1UL << IAC_IER2_IAIE91_Pos)             /*!< 0x08000000 */
#define IAC_IER2_IAIE91               IAC_IER2_IAIE91_Msk
#define IAC_IER2_IAIE92_Pos           (28U)
#define IAC_IER2_IAIE92_Msk           (0x1UL << IAC_IER2_IAIE92_Pos)             /*!< 0x10000000 */
#define IAC_IER2_IAIE92               IAC_IER2_IAIE92_Msk
#define IAC_IER2_IAIE93_Pos           (29U)
#define IAC_IER2_IAIE93_Msk           (0x1UL << IAC_IER2_IAIE93_Pos)             /*!< 0x20000000 */
#define IAC_IER2_IAIE93               IAC_IER2_IAIE93_Msk
#define IAC_IER2_IAIE94_Pos           (30U)
#define IAC_IER2_IAIE94_Msk           (0x1UL << IAC_IER2_IAIE94_Pos)             /*!< 0x40000000 */
#define IAC_IER2_IAIE94               IAC_IER2_IAIE94_Msk
#define IAC_IER2_IAIE95_Pos           (31U)
#define IAC_IER2_IAIE95_Msk           (0x1UL << IAC_IER2_IAIE95_Pos)             /*!< 0x80000000 */
#define IAC_IER2_IAIE95               IAC_IER2_IAIE95_Msk

