STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251dxx_cm33.h
/********************  Bits definition for TAMP_SR register  *****************/
#define TAMP_SR_TAMP1F_Pos           (0U)
#define TAMP_SR_TAMP1F_Msk           (0x1UL << TAMP_SR_TAMP1F_Pos)                      /*!< 0x00000001U */
#define TAMP_SR_TAMP1F               TAMP_SR_TAMP1F_Msk
#define TAMP_SR_TAMP2F_Pos           (1U)
#define TAMP_SR_TAMP2F_Msk           (0x1UL << TAMP_SR_TAMP2F_Pos)                      /*!< 0x00000002U */
#define TAMP_SR_TAMP2F               TAMP_SR_TAMP2F_Msk
#define TAMP_SR_TAMP3F_Pos           (2U)
#define TAMP_SR_TAMP3F_Msk           (0x1UL << TAMP_SR_TAMP3F_Pos)                      /*!< 0x00000004U */
#define TAMP_SR_TAMP3F               TAMP_SR_TAMP3F_Msk
#define TAMP_SR_TAMP4F_Pos           (3U)
#define TAMP_SR_TAMP4F_Msk           (0x1UL << TAMP_SR_TAMP4F_Pos)                      /*!< 0x00000008U */
#define TAMP_SR_TAMP4F               TAMP_SR_TAMP4F_Msk
#define TAMP_SR_TAMP5F_Pos           (4U)
#define TAMP_SR_TAMP5F_Msk           (0x1UL << TAMP_SR_TAMP5F_Pos)                      /*!< 0x00000010U */
#define TAMP_SR_TAMP5F               TAMP_SR_TAMP5F_Msk
#define TAMP_SR_TAMP6F_Pos           (5U)
#define TAMP_SR_TAMP6F_Msk           (0x1UL << TAMP_SR_TAMP6F_Pos)                      /*!< 0x00000020U */
#define TAMP_SR_TAMP6F               TAMP_SR_TAMP6F_Msk
#define TAMP_SR_TAMP7F_Pos           (6U)
#define TAMP_SR_TAMP7F_Msk           (0x1UL << TAMP_SR_TAMP7F_Pos)                      /*!< 0x00000040U */
#define TAMP_SR_TAMP7F               TAMP_SR_TAMP7F_Msk
#define TAMP_SR_TAMP8F_Pos           (7U)
#define TAMP_SR_TAMP8F_Msk           (0x1UL << TAMP_SR_TAMP8F_Pos)                      /*!< 0x00000080U */
#define TAMP_SR_TAMP8F               TAMP_SR_TAMP8F_Msk
#define TAMP_SR_ITAMP1F_Pos          (16U)
#define TAMP_SR_ITAMP1F_Msk          (0x1UL << TAMP_SR_ITAMP1F_Pos)                     /*!< 0x00010000U */
#define TAMP_SR_ITAMP1F              TAMP_SR_ITAMP1F_Msk
#define TAMP_SR_ITAMP2F_Pos          (17U)
#define TAMP_SR_ITAMP2F_Msk          (0x1UL << TAMP_SR_ITAMP2F_Pos)                     /*!< 0x00020000U */
#define TAMP_SR_ITAMP2F              TAMP_SR_ITAMP2F_Msk
#define TAMP_SR_ITAMP3F_Pos          (18U)
#define TAMP_SR_ITAMP3F_Msk          (0x1UL << TAMP_SR_ITAMP3F_Pos)                     /*!< 0x00040000U */
#define TAMP_SR_ITAMP3F              TAMP_SR_ITAMP3F_Msk
#define TAMP_SR_ITAMP4F_Pos          (19U)
#define TAMP_SR_ITAMP4F_Msk          (0x1UL << TAMP_SR_ITAMP4F_Pos)                     /*!< 0x00040000U */
#define TAMP_SR_ITAMP4F              TAMP_SR_ITAMP4F_Msk
#define TAMP_SR_ITAMP5F_Pos          (20U)
#define TAMP_SR_ITAMP5F_Msk          (0x1UL << TAMP_SR_ITAMP5F_Pos)                     /*!< 0x00100000U */
#define TAMP_SR_ITAMP5F              TAMP_SR_ITAMP5F_Msk
#define TAMP_SR_ITAMP6F_Pos          (21U)
#define TAMP_SR_ITAMP6F_Msk          (0x1UL << TAMP_SR_ITAMP6F_Pos)                     /*!< 0x00200000U */
#define TAMP_SR_ITAMP6F              TAMP_SR_ITAMP6F_Msk
#define TAMP_SR_ITAMP7F_Pos          (22U)
#define TAMP_SR_ITAMP7F_Msk          (0x1UL << TAMP_SR_ITAMP7F_Pos)                     /*!< 0x00400000U */
#define TAMP_SR_ITAMP7F              TAMP_SR_ITAMP7F_Msk
#define TAMP_SR_ITAMP8F_Pos          (23U)
#define TAMP_SR_ITAMP8F_Msk          (0x1UL << TAMP_SR_ITAMP8F_Pos)                     /*!< 0x00800000U */
#define TAMP_SR_ITAMP8F              TAMP_SR_ITAMP8F_Msk
#define TAMP_SR_ITAMP9F_Pos          (24U)
#define TAMP_SR_ITAMP9F_Msk          (0x1UL << TAMP_SR_ITAMP9F_Pos)                     /*!< 0x01000000U */
#define TAMP_SR_ITAMP9F              TAMP_SR_ITAMP9F_Msk
#define TAMP_SR_ITAMP10F_Pos         (25U)
#define TAMP_SR_ITAMP10F_Msk         (0x1UL << TAMP_SR_ITAMP10F_Pos)                    /*!< 0x02000000U */
#define TAMP_SR_ITAMP10F             TAMP_SR_ITAMP10F_Msk
#define TAMP_SR_ITAMP11F_Pos         (26U)
#define TAMP_SR_ITAMP11F_Msk         (0x1UL << TAMP_SR_ITAMP11F_Pos)                    /*!< 0x04000000U */
#define TAMP_SR_ITAMP11F             TAMP_SR_ITAMP11F_Msk
#define TAMP_SR_ITAMP12F_Pos         (27U)
#define TAMP_SR_ITAMP12F_Msk         (0x1UL << TAMP_SR_ITAMP12F_Pos)                    /*!< 0x08000000U */
#define TAMP_SR_ITAMP12F             TAMP_SR_ITAMP12F_Msk
#define TAMP_SR_ITAMP14F_Pos         (29U)
#define TAMP_SR_ITAMP14F_Msk         (0x1UL << TAMP_SR_ITAMP14F_Pos)                    /*!< 0x20000000U */
#define TAMP_SR_ITAMP14F             TAMP_SR_ITAMP14F_Msk
#define TAMP_SR_ITAMP15F_Pos         (30U)
#define TAMP_SR_ITAMP15F_Msk         (0x1UL << TAMP_SR_ITAMP15F_Pos)                    /*!< 0x40000000U */
#define TAMP_SR_ITAMP15F             TAMP_SR_ITAMP15F_Msk

/********************  Bits definition for TAMP_MISR register  ****************/
#define TAMP_MISR_TAMP1MF_Pos        (0U)
#define TAMP_MISR_TAMP1MF_Msk        (0x1UL << TAMP_MISR_TAMP1MF_Pos)                   /*!< 0x00000001U */
#define TAMP_MISR_TAMP1MF            TAMP_MISR_TAMP1MF_Msk
#define TAMP_MISR_TAMP2MF_Pos        (1U)
#define TAMP_MISR_TAMP2MF_Msk        (0x1UL << TAMP_MISR_TAMP2MF_Pos)                   /*!< 0x00000002U */
#define TAMP_MISR_TAMP2MF            TAMP_MISR_TAMP2MF_Msk
#define TAMP_MISR_TAMP3MF_Pos        (2U)
#define TAMP_MISR_TAMP3MF_Msk        (0x1UL << TAMP_MISR_TAMP3MF_Pos)                   /*!< 0x00000004U */
#define TAMP_MISR_TAMP3MF            TAMP_MISR_TAMP3MF_Msk
#define TAMP_MISR_TAMP4MF_Pos        (3U)
#define TAMP_MISR_TAMP4MF_Msk        (0x1UL << TAMP_MISR_TAMP4MF_Pos)                   /*!< 0x00000008U */
#define TAMP_MISR_TAMP4MF            TAMP_MISR_TAMP4MF_Msk
#define TAMP_MISR_TAMP5MF_Pos        (4U)
#define TAMP_MISR_TAMP5MF_Msk        (0x1UL << TAMP_MISR_TAMP5MF_Pos)                   /*!< 0x00000010U */
#define TAMP_MISR_TAMP5MF            TAMP_MISR_TAMP5MF_Msk
#define TAMP_MISR_TAMP6MF_Pos        (5U)
#define TAMP_MISR_TAMP6MF_Msk        (0x1UL << TAMP_MISR_TAMP6MF_Pos)                   /*!< 0x00000020U */
#define TAMP_MISR_TAMP6MF            TAMP_MISR_TAMP6MF_Msk
#define TAMP_MISR_TAMP7MF_Pos        (6U)
#define TAMP_MISR_TAMP7MF_Msk        (0x1UL << TAMP_MISR_TAMP7MF_Pos)                   /*!< 0x00000040U */
#define TAMP_MISR_TAMP7MF            TAMP_MISR_TAMP7MF_Msk
#define TAMP_MISR_TAMP8MF_Pos        (7U)
#define TAMP_MISR_TAMP8MF_Msk        (0x1UL << TAMP_MISR_TAMP8MF_Pos)                   /*!< 0x00000080U */
#define TAMP_MISR_TAMP8MF            TAMP_MISR_TAMP8MF_Msk
#define TAMP_MISR_ITAMP1MF_Pos       (16U)
#define TAMP_MISR_ITAMP1MF_Msk       (0x1UL << TAMP_MISR_ITAMP1MF_Pos)                  /*!< 0x00010000U */
#define TAMP_MISR_ITAMP1MF           TAMP_MISR_ITAMP1MF_Msk
#define TAMP_MISR_ITAMP2MF_Pos       (17U)
#define TAMP_MISR_ITAMP2MF_Msk       (0x1UL << TAMP_MISR_ITAMP2MF_Pos)                  /*!< 0x00020000U */
#define TAMP_MISR_ITAMP2MF           TAMP_MISR_ITAMP2MF_Msk
#define TAMP_MISR_ITAMP3MF_Pos       (18U)
#define TAMP_MISR_ITAMP3MF_Msk       (0x1UL << TAMP_MISR_ITAMP3MF_Pos)                  /*!< 0x00040000U */
#define TAMP_MISR_ITAMP3MF           TAMP_MISR_ITAMP3MF_Msk
#define TAMP_MISR_ITAMP4MF_Pos       (19U)
#define TAMP_MISR_ITAMP4MF_Msk       (0x1UL << TAMP_MISR_ITAMP4MF_Pos)                  /*!< 0x00080000U */
#define TAMP_MISR_ITAMP4MF           TAMP_MISR_ITAMP4MF_Msk
#define TAMP_MISR_ITAMP5MF_Pos       (20U)
#define TAMP_MISR_ITAMP5MF_Msk       (0x1UL << TAMP_MISR_ITAMP5MF_Pos)                  /*!< 0x00100000U */
#define TAMP_MISR_ITAMP5MF           TAMP_MISR_ITAMP5MF_Msk
#define TAMP_MISR_ITAMP6MF_Pos       (21U)
#define TAMP_MISR_ITAMP6MF_Msk       (0x1UL << TAMP_MISR_ITAMP6MF_Pos)                  /*!< 0x00200000U */
#define TAMP_MISR_ITAMP6MF           TAMP_MISR_ITAMP6MF_Msk
#define TAMP_MISR_ITAMP7MF_Pos       (22U)
#define TAMP_MISR_ITAMP7MF_Msk       (0x1UL << TAMP_MISR_ITAMP7MF_Pos)                  /*!< 0x00400000U */
#define TAMP_MISR_ITAMP7MF           TAMP_MISR_ITAMP7MF_Msk
#define TAMP_MISR_ITAMP8MF_Pos       (23U)
#define TAMP_MISR_ITAMP8MF_Msk       (0x1UL << TAMP_MISR_ITAMP8MF_Pos)                  /*!< 0x00800000U */
#define TAMP_MISR_ITAMP8MF           TAMP_MISR_ITAMP8MF_Msk
#define TAMP_MISR_ITAMP9MF_Pos       (24U)
#define TAMP_MISR_ITAMP9MF_Msk       (0x1UL << TAMP_MISR_ITAMP9MF_Pos)                  /*!< 0x01000000U */
#define TAMP_MISR_ITAMP9MF           TAMP_MISR_ITAMP9MF_Msk
#define TAMP_MISR_ITAMP10MF_Pos      (25U)
#define TAMP_MISR_ITAMP10MF_Msk      (0x1UL << TAMP_MISR_ITAMP10MF_Pos)                 /*!< 0x02000000U */
#define TAMP_MISR_ITAMP10MF          TAMP_MISR_ITAMP10MF_Msk
#define TAMP_MISR_ITAMP11MF_Pos      (26U)
#define TAMP_MISR_ITAMP11MF_Msk      (0x1UL << TAMP_MISR_ITAMP11MF_Pos)                 /*!< 0x04000000U */
#define TAMP_MISR_ITAMP11MF          TAMP_MISR_ITAMP11MF_Msk
#define TAMP_MISR_ITAMP12MF_Pos      (27U)
#define TAMP_MISR_ITAMP12MF_Msk      (0x1UL << TAMP_MISR_ITAMP12MF_Pos)                 /*!< 0x08000000U */
#define TAMP_MISR_ITAMP12MF          TAMP_MISR_ITAMP12MF_Msk
#define TAMP_MISR_ITAMP14MF_Pos      (29U)
#define TAMP_MISR_ITAMP14MF_Msk      (0x1UL << TAMP_MISR_ITAMP14MF_Pos)                 /*!< 0x20000000U */
#define TAMP_MISR_ITAMP14MF          TAMP_MISR_ITAMP14MF_Msk
#define TAMP_MISR_ITAMP15MF_Pos      (30U)
#define TAMP_MISR_ITAMP15MF_Msk      (0x1UL << TAMP_MISR_ITAMP15MF_Pos)                 /*!< 0x40000000U */
#define TAMP_MISR_ITAMP15MF          TAMP_MISR_ITAMP15MF_Msk

